---
kind: method
id: M:Autodesk.Revit.DB.FilteredElementCollector.GetBasicIEnumerator
zh: 筛选、过滤
source: html/07236f22-1721-1f6e-0fb6-f03709923430.htm
---
# Autodesk.Revit.DB.FilteredElementCollector.GetBasicIEnumerator Method

**中文**: 筛选、过滤

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.